# Restore everything on a new machine with:
# brew bundle install --file=~/Brewfile
#
tap "1password/tap"
tap "azure/bicep"
tap "azure/functions"
tap "crumbyte/noxdir"
tap "ellie/atuin"
tap "go-swagger/go-swagger"
tap "grain-lang/tap"
tap "hashicorp/tap"
tap "helix-editor/helix"
tap "homebrew/services"
tap "iann0036/iamlive"
tap "jesseduffield/lazygit"
tap "jmespath/jmespath"
tap "julien-cpsn/atac"
tap "mlb-rs/mlbt"
tap "mongodb/brew"
tap "pulumi/tap"
tap "xwmx/taps"
tap "ycd/tap"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Azure Storage data transfer utility
brew "azcopy"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Language Server for Bash
brew "bash-language-server"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Python code formatter
brew "black"
# Interface bandwidth monitor
brew "bmon"
# Install RubyGems as Homebrew formulae
brew "brew-gem"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Core application library for C
brew "glib"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# JSON, YAML, TOML, XML, and CSV query and modification tool
brew "dasel"
# Diff that understands syntax
brew "difftastic"
# File comparison utilities
brew "diffutils"
# Command-line DNS client
brew "dog"
# Command-line DNS Client for Humans
brew "doggo"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Asynchronous event library
brew "libevent"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Create thumbnails for your video files
brew "ffmpegthumbnailer"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# Google Drive CLI Client
brew "gdrive"
brew "gem-gist"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Small git utilities
brew "git-extras"
# Git extension for versioning large files
brew "git-lfs"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Apply a diff file to an original
brew "gpatch"
# Image manipulation
brew "netpbm"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GitHub Markdown previewer
brew "grip"
# Kubernetes package manager
brew "helm"
# Command-line hex viewer
brew "hexyl"
# Improved top (interactive process viewer)
brew "htop"
# Configurable static site generator
brew "hugo"
# Command-line benchmarking tool
brew "hyperfine"
# Tool to report network interface bandwidth
brew "ifstat"
# Display an interface's bandwidth usage
brew "iftop"
# CLI for managing resources in InfluxDB v2
brew "influxdb-cli"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Command-line interface for JFrog products
brew "jfrog-cli"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# API Traffic Analyzer providing real-time visibility into Kubernetes network
brew "kubeshark"
# Simple terminal UI for git commands
brew "lazygit"
# Pager program similar to more
brew "less"
# General purpose TCP-IP emulator
brew "libslirp"
# Linux virtual machines
brew "lima"
# High-performance theorem prover
brew "z3"
# Next-gen compiler infrastructure
brew "llvm"
# Text-based web browser
brew "lynx"
# Utility for directing compilation
brew "make"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Media player based on MPlayer and mplayer2
brew "mpv"
# NCurses Disk Usage
brew "ncdu"
# Utility for managing network connections
brew "netcat"
# HTTP/2 C Library
brew "nghttp2"
# Realtime console network usage monitor
brew "nload"
# Port scanning utility for large networks
brew "nmap"
# Libraries for security-enabled client and server applications
brew "nss"
# Manage multiple Node.js versions
brew "nvm"
# Generate clients, server & docs from an OpenAPI spec (v2, v3)
brew "openapi-generator"
# Open source suite of directory software
brew "openldap"
# OpenShift command-line interface tools
brew "openshift-cli"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Shell command parallelization utility
brew "parallel"
# Highly capable, feature-rich programming language
brew "perl"
# Indents and reformats Perl scripts to make them easier to read
brew "perltidy"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Tool for managing OCI containers and pods
brew "podman"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Generic machine emulator and virtualizer
brew "qemu"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Fuzzy Finder in rust!
brew "sk"
# Export Slack data without admin privileges
brew "slackdump"
# Soak up standard input and write to a file
brew "sponge", link: false
# Cross-shell prompt for astronauts
brew "starship"
# Command-line packet analyzer
brew "tcpdump"
# Network analyzer and capture tool - without graphical user interface
brew "wireshark"
# Terminal UI for tshark, inspired by Wireshark
brew "termshark"
# Terraform Language Server
brew "terraform-ls"
# Linter for Terraform files
brew "tflint"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line tool for sharing terminal over the web
brew "ttyd"
# Realtime plotting utility for terminal with data input from stdin
brew "ttyplot"
# Source code spell checker
brew "typos-cli"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Vi 'workalike' with many additional features
brew "vim"
# Execute commands when watched files change
brew "watchexec"
# Convert HTML to PDF
brew "weasyprint"
# Internet file retriever
brew "wget"
# Friendly and fast tool for sending HTTP requests
brew "xh"
# Linter for YAML files
brew "yamllint"
# JavaScript package manager
brew "yarn"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Bicep: next generation template language for Azure Resource Manager (ARM)
brew "azure/bicep/bicep"
# Azure Functions Core Tools 4.0
brew "azure/functions/azure-functions-core-tools@4"
# Toolkit to work with swagger for golang
brew "go-swagger/go-swagger/go-swagger"
# Packer
brew "hashicorp/tap/packer"
# Terraform
brew "hashicorp/tap/terraform"
# Generate an IAM policy from AWS, Azure, or Google Cloud (GCP) calls using client-side monitoring (CSM) or embedded proxy.
brew "iann0036/iamlive/iamlive"
# A simple API client (postman like) in your terminal
brew "julien-cpsn/atac/atac"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Run common networking tests against your site
brew "ycd/tap/dstp"
# Command-line interface for 1Password
cask "1password-cli"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# Web browser focusing on privacy
cask "brave-browser"
# Anthropic's official Claude AI desktop app
cask "claude"
# Web browser
cask "firefox"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Desktop automation application
cask "hammerspoon"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Terminal utility for visualizing file system usage.
cask "crumbyte/noxdir/noxdir"
# Open-source software for live streaming and screen recording
cask "obs"
# Instant messaging application focusing on security
cask "signal"
# System monitor for the menu bar
cask "stats"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
vscode "alefragnani.project-manager"
vscode "amandeepmittal.pug"
vscode "angular.ng-template"
vscode "anthropic.claude-code"
vscode "atlassian.atlascode"
vscode "aws-scripting-guy.cform"
vscode "bierner.markdown-preview-github-styles"
vscode "boto3typed.boto3-ide"
vscode "christian-kohler.npm-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "github.codespaces"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grain-lang.vscode-grain"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "kddejong.vscode-cfn-lint"
vscode "mads-hartmann.bash-ide-vscode"
vscode "matangover.mypy"
vscode "mdickin.markdown-shortcuts"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "mhutchie.git-graph"
vscode "ms-azure-load-testing.microsoft-testing"
vscode "ms-azuretools.azure-dev"
vscode "ms-azuretools.vscode-azure-github-copilot"
vscode "ms-azuretools.vscode-azure-mcp-server"
vscode "ms-azuretools.vscode-azureappservice"
vscode "ms-azuretools.vscode-azurecontainerapps"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestaticwebapps"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-azureterraform"
vscode "ms-azuretools.vscode-azurevirtualmachines"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-cosmosdb"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azurecli"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-node-azure-pack"
vscode "ms-windows-ai-studio.windows-ai-studio"
vscode "paragdiwan.gitpatch"
vscode "pomdtr.excalidraw-editor"
vscode "redhat.vscode-yaml"
vscode "rogalmic.bash-debug"
vscode "rust-lang.rust-analyzer"
vscode "shakram02.bash-beautify"
vscode "tamasfe.even-better-toml"
vscode "thoroughcity.json-transform-vscode"
vscode "timonwong.shellcheck"
vscode "upstash.context7-mcp"
vscode "usernamehw.errorlens"
vscode "vscodevim.vim"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zeshuaro.vscode-python-poetry"
vscode "ziglang.vscode-zig"
go "github.com/go-delve/delve/cmd/dlv"
go "cmd/go"
go "cmd/gofmt"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "github.com/josharian/impl"
go "github.com/mlbright/sponge"
cargo "cargo-modules"
cargo "gh-repo-list"
cargo "mlbt"
cargo "rustowl"
cargo "skreg-cli"
cargo "tealdeer"
